InformationRegisters/БесконтактнаяПередачаТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>БесконтактнаяПередачаТС</Name>
			<Comment>Бесконтактная передача ТС в Мир Хендэ</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерЯчейки</Name>
					<Comment>Номер ячейки для закладки ключа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PINКод</Name>
					<Comment>PIN-код для доступа к ячейке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПланируемаяДатаЗакладки</Name>
					<Comment>Планируемая дата закладки ключа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическаяДатаЗакладки</Name>
					<Comment>Фактическая дата закладки ключа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыемки</Name>
					<Comment>Дата выемки ключа из ячейки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаРемонт</Name>
					<Comment>Ссылка на Заявку на ремонт</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРемонт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Напоминания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Напоминания</Name>
			<Comment>Данный Регистр предназначен для реализации механизма напоминаний. Напоминание - сообщение которое может быть выведено на экран любому пользователю конфигурации единожды либо с заданной регулярностью.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Comment>Дата до которой напоминание считается актуальным. После этой даты даже не завершенные напоминания выводится не будут.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата оповещения как она заложена в напоминании без учета отсрочки напоминания пользователем и предварительного вывода напоминания.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОповещения</Name>
					<Comment>Дата очередного напоминания, для непериодических напоминаний равняется дате начала как она заложена в напоминании без учета отсрочки напоминания пользователем и предварительного вывода напоминания.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Comment>Описание напоминания - сообщение содержащее суть напоминания.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Редактирование</Name>
					<Comment>Индикатор редактирования объекта. Предназначен для запрета открытия и вывода напоминания во время редактирования</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДоНачала</Name>
					<Comment>Предназначен для хранения срока в секундах за который нужно предупредить о наступлении события</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тема</Name>
					<Comment>Заголовок окна, который будет выведен при отображении напоминания</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПериода</Name>
					<Comment>Строка хранящая тип периода напоминания (1 -8) символ –  тип периодичности дня, (9  - 14) cимвол тип периодичности недели,  (15  - 16) cимвол тип периодичности месяца,  (17  - 18) cимвол тип периодичности года </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьПоИстеченииСрока</Name>
					<Comment>Признак удаления напоминания после истечения даты актуальности, или после завершения(для не периодических напоминаний)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Реквизит предназначен для хранения ссылки на получателя напоминания</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автор</Name>
					<Comment>Реквизит предназначен для хранения ссылки на автора напоминания - (текущего пользователя), который создал напоминание</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Завершено</Name>
					<Comment>Реквизит предназначен для хранения флага завершенности напоминания</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РеальнаяДатаОповещения</Name>
					<Comment>Реквизит предназначен для хранения реальной даты когда будет выведено напоминание</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Ссылка на объект конфигурации прилагаемый к напоминанию</Comment>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ДополнительнаяИнформацияАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ДополнительнаяИнформацияАвтомобилей</Name>
			<Comment>Дополнительная информация автомобилей</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Хозяин</Name>
					<Comment>Признак хозяина автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пробег</Name>
					<Comment>Признак пробега автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосНомер</Name>
					<Comment>Признак государственного номера автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехПаспорт</Name>
					<Comment>Признак номера техпаспорта автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидАвтомобиля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаКонсигнации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервиснаяКнижка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПараллельныйИмпорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаОкончанияОтсрочкиОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГаражныйНомер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапретНаВнутренниеПерепродажи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыКонтрагентов</Name>
			<Comment>Виды контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупатель</Name>
					<Comment>Основное взаимодействие с контрагентом - продажа, передача на комиссию, хранение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>Основное взаимодействие с контрагентом - закупка и принятие на комиссию, хранение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодотчетноеЛицо</Name>
					<Comment>Подотчетное лицо компании</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Филиал</Name>
					<Comment>Филиал компании, одна из организаций</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собственник</Name>
					<Comment>Собственник компании, осуществляющий финансирование</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Comment>Контактное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочие контрагенты</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ФормыСобственности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ФормыСобственности</Name>
			<Comment>Варианты форм собственности контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Comment>Любая форма юридического лица</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастныйПредприниматель</Name>
					<Comment>Частный предприниматель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастноеЛицо</Name>
					<Comment>Частное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочий вид собственности</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыОтветов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВариантыОтветов</Name>
			<Comment>используется в правах-настройках пользователей</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Спрашивать</Name>
					<Comment>Будет открыт диалог на выбор варианта: "Да" - выполнить действие "Нет" - отменить действие</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Да</Name>
					<Comment>Данное право (настройка) разрешает действие пользователю</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
					<Comment>Данное право (настройка) запрещает действие пользователю</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

WebServices/Kiosk/Ext/Module.bsl
//Описание входящих параметров
                                                                                    //Возможные возвращаемые значения
//ТипЗапроса 		= KioskMessageSendRequest.KioskMessageSend.Type; 				//1 - Предварительный запрос клиента, 2 - Время закрытия бокса клиентом, 3 - Время закрытия бокса мастером-приёмщиком
//ДатаЗапроса 		= KioskMessageSendRequest.KioskMessageSend.ActionDateTime;  	//2021-03-16T15:00:00
//НомерБокса		= KioskMessageSendRequest.KioskMessageSend.Box_Number;      	//3
//PIN				= KioskMessageSendRequest.KioskMessageSend.PIN;            		//978123
//ДатаДоставкиАвто	= KioskMessageSendRequest.KioskMessageSend.ProposedDateTimeSlot;//2021-03-16T23:59:59
//VIN				= KioskMessageSendRequest.KioskMessageSend.VIN;             	//TMAJ3813DGJ235335
//НомерЗаписи		= KioskMessageSendRequest.KioskMessageSend.DMS_AppointmentNo;   //НАЦН00060199
//ИдЗаписи			= KioskMessageSendRequest.KioskMessageSend.DMS_AppointmentID;   //e449d202-53da-11eb-8612-003048cea8da
//ВнешнийИдЗаписи	= KioskMessageSendRequest.KioskMessageSend.ExternalBookingID    //123456
//ФИОКлиента		= KioskMessageSendRequest.KioskMessageSend.CustomerName;        //Петров Иван
//ТелефонКлиента	= KioskMessageSendRequest.KioskMessageSend.CustomerPhone;       //79111111111
//Модель			= KioskMessageSendRequest.KioskMessageSend.ModelName;           //Creta
//ГосНомер			= KioskMessageSendRequest.KioskMessageSend.PlateNo;             //H277CE46
//ПричинаОбращения	= KioskMessageSendRequest.KioskMessageSend.CustomerRequest;     //ТО-1, Обратить внимание на задние тормоза
//МассивФотографий  = KioskMessageSendRequest.KioskMessageSend.Photos               //Фотографии сделанные клиентом перед сдачей автомобиля (в формате Base64)
	
Функция KioskMessageSend(KioskMessageSendRequest)
	KioskMessageSendType = ФабрикаXDTO.Тип("http://wa.dms.webservice/KioskMessageSendRequest", "KioskMessageSendResponse");
	KioskMessageSend = ФабрикаXDTO.Создать(KioskMessageSendType);
	
	ТаблицаОшибок = Новый ТаблицаЗначений;
    ТаблицаОшибок.Колонки.Добавить("Код",	 Новый ОписаниеТипов("Строка"));
    ТаблицаОшибок.Колонки.Добавить("ТекстОшибки",		 Новый ОписаниеТипов("Строка"));
	
	Попытка
		DealerID = KioskMessageSendRequest.TransactionHeader.DealerID;
	Исключение
		НоваяСтрока = ТаблицаОшибок.Добавить();
		НоваяСтрока.Код = "WA03";
		НоваяСтрока.ТекстОшибки = "Отсутствует идентификатор дилера";
		KioskMessageSend = обПолучитьВозвратWAError("http://wa.dms.webservice/KioskMessageSendRequest",KioskMessageSendRequest,KioskMessageSend,"-1",ТаблицаОшибок);
		Возврат KioskMessageSend;   
	КонецПопытки;
	
	KioskMessageSendData = KioskMessageSendRequest.KioskMessageSend;
	Попытка
		IDЗаявкиНаРемонт = KioskMessageSendData.DMS_AppointmentID;
	Исключение
		НоваяСтрока = ТаблицаОшибок.Добавить();
		НоваяСтрока.Код = "WA03";
		НоваяСтрока.ТекстОшибки = "Отсутствует идентификатор заявки на ремонт";
		KioskMessageSend = обПолучитьВозвратWAError("http://wa.dms.webservice/KioskMessageSendRequest",KioskMessageSendRequest,KioskMessageSend,"-1",ТаблицаОшибок);
		Возврат KioskMessageSend;   
	КонецПопытки;	
	
	Попытка
		НомерЗаявкиНаРемонт = KioskMessageSendData.DMS_AppointmentNo;
	Исключение
		НоваяСтрока = ТаблицаОшибок.Добавить();
		НоваяСтрока.Код = "WA03";
		НоваяСтрока.ТекстОшибки = "Отсутствует номер заявки на ремонт";
		KioskMessageSend = обПолучитьВозвратWAError("http://wa.dms.webservice/KioskMessageSendRequest",KioskMessageSendRequest,KioskMessageSend,"-1",ТаблицаОшибок);
		Возврат KioskMessageSend;   
	КонецПопытки;
	
	Если ЗначениеЗаполнено(IDЗаявкиНаРемонт) Тогда         				
		Попытка
			ID = Новый УникальныйИдентификатор(IDЗаявкиНаРемонт);
		Исключение
			НоваяСтрока = ТаблицаОшибок.Добавить();
			НоваяСтрока.Код = "WA03";
			НоваяСтрока.ТекстОшибки = "Некорректный идентификатор заявки на ремонт";
			KioskMessageSend = обПолучитьВозвратWAError("http://wa.dms.webservice/KioskMessageSendRequest",KioskMessageSendRequest,KioskMessageSend,"-1",ТаблицаОшибок);
			Возврат KioskMessageSend;   		
		КонецПопытки;
		
		ЗаявкаНаРемонтСсылка = Документы.ЗаявкаНаРемонт.ПолучитьСсылку(ID);
		Если стрНайти(Строка(ЗаявкаНаРемонтСсылка), "<Объект не найден>") > 0 Тогда
			НоваяСтрока = ТаблицаОшибок.Добавить();
			НоваяСтрока.Код = "WA03";
			НоваяСтрока.ТекстОшибки = "Некорректный идентификатор заявки на ремонт";
			KioskMessageSend = обПолучитьВозвратWAError("http://wa.dms.webservice/KioskMessageSendRequest",KioskMessageSendRequest,KioskMessageSend,"-1",ТаблицаОшибок);
			Возврат KioskMessageSend;   	
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(НомерЗаявкиНаРемонт) Тогда         				
		ЗаявкаНаРемонтСсылка = Документы.ЗаявкаНаРемонт.НайтиПоНомеру(НомерЗаявкиНаРемонт, ТекущаяДата());
		Если обЗначениеНеЗаполнено(ЗаявкаНаРемонтСсылка) Тогда
			НоваяСтрока = ТаблицаОшибок.Добавить();
			НоваяСтрока.Код = "WA03";
			НоваяСтрока.ТекстОшибки = "Заявка на ремонт с указанным номером не найдена";
			KioskMessageSend = обПолучитьВозвратWAError("http://wa.dms.webservice/KioskMessageSendRequest",KioskMessageSendRequest,KioskMessageSend,"-1",ТаблицаОшибок);
			Возврат KioskMessageSend;   		
		КонецЕсли;
		
	Иначе
		НоваяСтрока = ТаблицаОшибок.Добавить();
		НоваяСтрока.Код = "WA03";
		НоваяСтрока.ТекстОшибки = "Не задано ни одного ключевого параметра для бесконтактной передачи ТС";
		KioskMessageSend = обПолучитьВозвратWAError("http://wa.dms.webservice/KioskMessageSendRequest",KioskMessageSendRequest,KioskMessageSend,"-1",ТаблицаОшибок);
		Возврат KioskMessageSend;		
	КонецЕсли;
	
	Попытка
		Подразделение = ЗаявкаНаРемонтСсылка.ПодразделениеКомпании;
	Исключение
		НоваяСтрока = ТаблицаОшибок.Добавить();
		НоваяСтрока.Код = "WA03";
		НоваяСтрока.ТекстОшибки = "Заявка на ремонт с указанным идентификатором не найдена";
		KioskMessageSend = обПолучитьВозвратWAError("http://wa.dms.webservice/KioskMessageSendRequest",KioskMessageSendRequest,KioskMessageSend,"-1",ТаблицаОшибок);
		Возврат KioskMessageSend;		
	КонецПопытки;
	
	стДанныеСообщения = Новый Структура();
	стДанныеСообщения.Вставить("ТипСообщения", KioskMessageSendData.Type);
	стДанныеСообщения.Вставить("Клиент", KioskMessageSendData.CustomerName);
	стДанныеСообщения.Вставить("Телефон", KioskMessageSendData.CustomerPhone);
	стДанныеСообщения.Вставить("Модель", KioskMessageSendData.ModelName);
	стДанныеСообщения.Вставить("VIN", KioskMessageSendData.VIN);
	стДанныеСообщения.Вставить("ГосНомер", KioskMessageSendData.PlateNo);
	стДанныеСообщения.Вставить("ДатаОперации", KioskMessageSendData.ActionDateTime);
	стДанныеСообщения.Вставить("ЗаявкаНаРемонтНомер", KioskMessageSendData.DMS_AppointmentNo);
	стДанныеСообщения.Вставить("НомерЯчейки", KioskMessageSendData.Box_Number);
	стДанныеСообщения.Вставить("PINКод", KioskMessageSendData.PIN);
	стДанныеСообщения.Вставить("ИдентификаторВнешний", KioskMessageSendData.ExternalBookingID);
	стДанныеСообщения.Вставить("ИдентификаторВнутренний", KioskMessageSendData.DMS_AppointmentID);
	стДанныеСообщения.Вставить("ЗаявкаНаРемонт", ЗаявкаНаРемонтСсылка);
	стДанныеСообщения.Вставить("DealerID", DealerID);
	
	мзБесконтактнаяПередачаТС = РегистрыСведений.БесконтактнаяПередачаТС.СоздатьМенеджерЗаписи();
	мзБесконтактнаяПередачаТС.ЗаявкаНаРемонт = ЗаявкаНаРемонтСсылка;
	мзБесконтактнаяПередачаТС.Прочитать();
	Если Не мзБесконтактнаяПередачаТС.Выбран() Тогда
		мзБесконтактнаяПередачаТС.ЗаявкаНаРемонт = ЗаявкаНаРемонтСсылка;
	КонецЕсли;
	
	Если KioskMessageSendData.Type = "1" Тогда // Предварительный запрос клиента
		мзБесконтактнаяПередачаТС.ПланируемаяДатаЗакладки = KioskMessageSendData.ProposedDateTimeSlot;
		мзБесконтактнаяПередачаТС.Записать();
		стДанныеСообщения.ДатаОперации = KioskMessageSendData.ProposedDateTimeSlot;
		ОтправитьСообщениеБПТС(Подразделение, стДанныеСообщения);
		
	ИначеЕсли KioskMessageSendData.Type = "2" Тогда // Время закрытия бокса клиентом
		мзБесконтактнаяПередачаТС.ФактическаяДатаЗакладки = KioskMessageSendData.ActionDateTime;
		мзБесконтактнаяПередачаТС.НомерЯчейки = KioskMessageSendData.Box_Number;
		мзБесконтактнаяПередачаТС.PINКод = KioskMessageSendData.PIN;
		мзБесконтактнаяПередачаТС.Записать();
		
		СоздатьЗаказНаряд(стДанныеСообщения);
		ОтправитьСообщениеБПТС(Подразделение, стДанныеСообщения);
		
		стРезультат = ЗагрузитьФотоБПТС(ЗаявкаНаРемонтСсылка, KioskMessageSendData.Photos);
		Если стРезультат.Ошибка Тогда
			НоваяСтрока = ТаблицаОшибок.Добавить();
			НоваяСтрока.Код = "WA03";
			НоваяСтрока.ТекстОшибки = стРезультат.ТекстОшибки;
			KioskMessageSend = обПолучитьВозвратWAError("http://wa.dms.webservice/KioskMessageSendRequest",KioskMessageSendRequest,KioskMessageSend,"-1",ТаблицаОшибок);
			Возврат KioskMessageSend;		
		КонецЕсли;
		
	ИначеЕсли KioskMessageSendData.Type = "3" Тогда // Время закрытия бокса мастером-приёмщиком
		мзБесконтактнаяПередачаТС.ДатаВыемки = KioskMessageSendData.ActionDateTime;
		мзБесконтактнаяПередачаТС.Записать();
		
	Иначе
		НоваяСтрока = ТаблицаОшибок.Добавить();
		НоваяСтрока.Код = "WA03";
		НоваяСтрока.ТекстОшибки = "Неверное значение поля Type=" + KioskMessageSendData.Type;
		KioskMessageSend = обПолучитьВозвратWAError("http://wa.dms.webservice/KioskMessageSendRequest",KioskMessageSendRequest,KioskMessageSend,"-1",ТаблицаОшибок);
		Возврат KioskMessageSend;		
	КонецЕсли;
	
	
	KioskMessageSend = обПолучитьВозвратWAError("http://wa.dms.webservice/KioskMessageSendRequest",KioskMessageSendRequest,KioskMessageSend,"1",ТаблицаОшибок);
	Возврат KioskMessageSend;   

КонецФункции

Функция ЗагрузитьФотоБПТС(ЗаявкаНаРемонт, МассивФотографий)
	Результат = Новый Структура();
	Результат.Вставить("Ошибка", Ложь);
	Результат.Вставить("ТекстОшибки", "Неверное значение Photo.Value:");
	
	Для Каждого Фото Из МассивФотографий.Photo Цикл	
		ПозицияЗпт = стрНайти(Фото.Value, ",");
		Если ПозицияЗпт > 0 Тогда
			СтрокаDataURL = Лев(Фото.Value, ПозицияЗпт - 1);
			ПозицияСлэш = стрНайти(СтрокаDataURL, "/");
			Если ПозицияСлэш > 0 Тогда
				Расширение = "." + Сред(СтрокаDataURL, ПозицияСлэш + 1, 3);
			Иначе
				Результат.Ошибка = Истина;
				Результат.ТекстОшибки = Результат.ТекстОшибки + " " + Фото.Name;
				Продолжить;
			КонецЕсли;
			
			СтрокаBase64 = Сред(Фото.Value, ПозицияЗпт + 1);
			хзФото = Новый ХранилищеЗначения(Base64Значение(СтрокаBase64));			
			ОписаниеОшибки = "";
		 	ПолноеИмяФайла = ОбщиеСервер.СкопироватьНаСервер("Файлы", хзФото, Расширение, ОписаниеОшибки);
			Если обЗначениеНеЗаполнено(ПолноеИмяФайла) Тогда
				// Записать сообщение в журнал!!!
				Продолжить;
			КонецЕсли;			
			
		Иначе
			Результат.Ошибка = Истина;
			Результат.ТекстОшибки = Результат.ТекстОшибки + " " + Фото.Name;
			Продолжить;
		КонецЕсли;		
		
		ЗаписанныйФайл = Новый Файл(ПолноеИмяФайла);
		мзКартинкиИФайлы = РегистрыСведений.КартинкиИФайлы.СоздатьМенеджерЗаписи();
		мзКартинкиИФайлы.Объект = ЗаявкаНаРемонт;
		мзКартинкиИФайлы.Идентификатор = Фото.Name;
		
		мзКартинкиИФайлы.ИмяФайла = ПолноеИмяФайла;
	 	ОтносительныйПуть = СтрЗаменить(ПолноеИмяФайла, СокрЛП(Константы.ПустьКХранилищюСканов.Получить()), "");
		ОтносительныйПуть = СтрЗаменить(ОтносительныйПуть, СокрЛП(ОбщиеСервер.ПолучитьИмяИБ()), "");
		Пока Лев(ОтносительныйПуть, 1) = "\" Цикл
			ОтносительныйПуть = Сред(ОтносительныйПуть, 2); 
	 	КонецЦикла; 
		мзКартинкиИФайлы.ОтносительныйПуть = ОтносительныйПуть;
		
		мзКартинкиИФайлы.НазваниеФайла = "Мир Хендэ - " + Фото.Name;
		мзКартинкиИФайлы.ДанныеВоВнешнемФайле = Истина;
		мзКартинкиИФайлы.ДатаСохранения = ТекущаяДата();
		мзКартинкиИФайлы.Картинка = Истина;
		мзКартинкиИФайлы.Комментарий = "Круговой осмотр при бесконтактной передаче ТС из Мир Хендэ";
		мзКартинкиИФайлы.РазмерФайла = ЗаписанныйФайл.Размер();
		мзКартинкиИФайлы.Расширение = Расширение;
		
		мзКартинкиИФайлы.Записать();
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Процедура ОтправитьСообщениеБПТС(Подразделение, ДанныеСообщения) // Бесконтактная Передача ТС
	Если ДанныеСообщения.ТипСообщения = "1" Тогда
		СтрокаСобытие = "выразил намерение поместить";
		НомерЯчейки = "";
		PINКод = "";
	ИначеЕсли ДанныеСообщения.ТипСообщения = "2" Тогда
		СтрокаСобытие = "поместил";
		НомерЯчейки = ДанныеСообщения.НомерЯчейки;
		PINКод = ДанныеСообщения.PINКод;
	Иначе
		Возврат;
	КонецЕсли;
	
	мКому = Новый Массив();
	Если ДанныеСообщения.DealerID = "RC536" Тогда
		мКому.Добавить("service_sh@hyundai-sokolmotors.ru");
		мКому.Добавить("service_operator@hyundai-sokolmotors.ru");
	Иначе
		мКому.Добавить("service_dm@sokolmotors.ru");
	КонецЕсли;
	
	РуководительСервиса = Подразделение.РуководительСервиса.Сотрудник;
	Если ЗначениеЗаполнено(РуководительСервиса) Тогда
		АдресЭлПочты = киПолучитьПредставлениеКИ(РуководительСервиса, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий);
		Если обЗначениеНеЗаполнено(АдресЭлПочты) Тогда
			АдресЭлПочты = РуководительСервиса.РабочийEmail;
		КонецЕсли;
		Если ЗначениеЗаполнено(АдресЭлПочты) Тогда
			мКому.Добавить(АдресЭлПочты);
		КонецЕсли;
	КонецЕсли;
		
	ТемаПисьма = "Клиент " + СтрокаСобытие + " ключ от ТС в ячейку. "
	+ ДанныеСообщения.Клиент + ", " + ДанныеСообщения.Телефон;
	
	ТелоПисьма = 
	"Клиент: " + ДанныеСообщения.Клиент + Символы.ПС
	+ "№ телефона Клиента: " + ДанныеСообщения.Телефон + Символы.ПС
	+ "Марка/Модель ТС Клиента: " + ДанныеСообщения.Модель + Символы.ПС
	+ "Гос. номер ТС Клиента: " + ДанныеСообщения.ГосНомер + Символы.ПС
	+ "VIN: " + ДанныеСообщения.VIN + Символы.ПС
	+ "Ячейка №: " + НомерЯчейки + Символы.ПС
	+ "PIN-код для извлечения ключей: " + PINКод + Символы.ПС
	+ "№ Заявки на ремонт " + ДанныеСообщения.ЗаявкаНаРемонтНомер + Символы.ПС
	+ "Идентификатор на ремонт (внешний) " + ДанныеСообщения.ИдентификаторВнешний + Символы.ПС
	+ "Идентификатор на ремонт (внутренний) " + ДанныеСообщения.ИдентификаторВнутренний + Символы.ПС + Символы.ПС
	+ "Наш Клиент " + ДанныеСообщения.Клиент + " воспользовался услугой ""Бесконтактная передача ТС на ремонт""." + Символы.ПС
	+ "Клиент " + СтрокаСобытие + " ключ от своего ТС " + ДанныеСообщения.ГосНомер + " в ячейку "
	+ Формат(ДанныеСообщения.ДатаОперации, "ДФ='дд.ММ.гггг ЧЧ:мм'");
	
	мКопии = Новый Массив();
	г_Функции.СоздатьИОтпраитьЭлПисьмо(мКому, мКопии, ТемаПисьма, ТелоПисьма, ДанныеСообщения.ЗаявкаНаРемонт);
КонецПроцедуры

Процедура СоздатьЗаказНаряд(ДанныеСообщения)
	Если ЗначениеЗаполнено(Документы.ЗаказНаряд.НайтиПоРеквизиту("ДокументОснование", ДанныеСообщения.ЗаявкаНаРемонт)) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаказНарядОбъект = Документы.ЗаказНаряд.СоздатьДокумент();
	ЗаказНарядОбъект.Заполнить(ДанныеСообщения.ЗаявкаНаРемонт);
	ЗаказНарядОбъект.УстановитьНовыйНомер();
	
	АвтомобильНайденВБазе = ЗначениеЗаполнено(ЗаказНарядОбъект.Автомобиль);
	Если Не АвтомобильНайденВБазе Тогда
		АвтомобильСсылка = Справочники.Автомобили.НайтиПоРеквизиту("VIN", ДанныеСообщения.VIN);
		Если ЗначениеЗаполнено(АвтомобильСсылка) Тогда
			ЗаказНарядОбъект.Автомобиль = АвтомобильСсылка;
			АвтомобильНайденВБазе = Истина;
		Иначе
			ЗаказНарядОбъект.Автомобиль = СоздатьАвтомобиль(ДанныеСообщения);
		КонецЕсли;
	КонецЕсли;
		
	Если обЗначениеНеЗаполнено(ЗаказНарядОбъект.Заказчик) Тогда
		КонтрагентСсылка = Справочники.Контрагенты.ПустаяСсылка();
		Если АвтомобильНайденВБазе Тогда
			КонтрагентСсылка = НайтиКонтрагента(ДанныеСообщения, ЗаказНарядОбъект.Автомобиль);
		КонецЕсли;
		Если обЗначениеНеЗаполнено(КонтрагентСсылка) Тогда
			КонтрагентСсылка = СоздатьКонтрагента(ДанныеСообщения);
		КонецЕсли;
		ЗаказНарядОбъект.Заказчик = КонтрагентСсылка;
		ЗаказНарядОбъект.Контрагент = КонтрагентСсылка;
	КонецЕсли;
	ЗаказНарядОбъект.Комментарий = "Создан при бесконтактной передаче ТС из Мир Хендэ";
	
	ЗаказНарядОбъект.ОбменДанными.Загрузка = Истина;
	Попытка
		ЗаказНарядОбъект.Записать();
	Исключение
	КонецПопытки;
	
	СоздатьНапоминание(ЗаказНарядОбъект.Ссылка, ЗаказНарядОбъект.Диспетчер);
КонецПроцедуры

Функция НайтиКонтрагента(ДанныеСообщения, АвтомобильСсылка)
	КонтрагентСсылка = Справочники.Контрагенты.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(АвтомобильСсылка) Тогда
		Хозяин = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(АвтомобильСсылка, Перечисления.ДополнительнаяИнформацияАвтомобилей.Хозяин);	
		Если обЗначениеНеЗаполнено(Хозяин) Или ТипЗнч(Хозяин) <> Тип("СправочникСсылка.Контрагенты") Тогда
			Возврат КонтрагентСсылка;
		КонецЕсли;
		
	Иначе
		Возврат КонтрагентСсылка;
	КонецЕсли;
	
	ЗапросКонтрагент = Новый Запрос;
	ЗапросКонтрагент.УстановитьПараметр("ФИО", "%" + ДанныеСообщения.Клиент + "%"); 		
	ЗапросКонтрагент.Текст = "ВЫБРАТЬ
	|	Контрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Наименование ПОДОБНО &ФИО";
								
	Результат = ЗапросКонтрагент.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Не Результат.Пустой() Тогда		
		Выборка	= Результат.Выбрать();      				
		Пока Выборка.Следующий() Цикл    					
			Если Выборка.Ссылка = Хозяин Тогда  						
				Возврат Хозяин;					
			КонецЕсли;					
		КонецЦикла;
	КонецЕсли;
	
	Возврат КонтрагентСсылка;
КонецФункции

Функция СоздатьКонтрагента(ДанныеСообщения)
	КонтрагентОбъект = Справочники.Контрагенты.СоздатьЭлемент();
	КонтрагентОбъект.УстановитьНовыйКод();
	КонтрагентОбъект.Родитель = Справочники.Контрагенты.Покупатели;
	КонтрагентОбъект.Наименование = ДанныеСообщения.Клиент;
	КонтрагентОбъект.НаименованиеПолное = ДанныеСообщения.Клиент;
	КонтрагентОбъект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Покупатель;
	КонтрагентОбъект.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо;
	КонтрагентОбъект.РекламныйИсточник = Справочники.ИсточникиИнформации.ОбщениеСМОПВИнтернет;
	КонтрагентОбъект.ОсновнойТелефон = ТелефонЦифрами(ДанныеСообщения.Телефон);
	КонтрагентОбъект.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Да;
	КонтрагентОбъект.СогласиеНаУчастиеВПрограммеПроактивныйКонтакт = Перечисления.ВариантыОтветов.Спрашивать;
	
	массивФИО = СтрРазделить(СокрЛП(ДанныеСообщения.Клиент), " ", Ложь);
	количествоФИО = массивФИО.Количество();
	Если количествоФИО = 1 Тогда
		КонтрагентОбъект.Фамилия = массивФИО[0];
		КонтрагентОбъект.Имя = массивФИО[0];
	ИначеЕсли количествоФИО = 2 Тогда
		КонтрагентОбъект.Фамилия = массивФИО[0];
		КонтрагентОбъект.Имя = массивФИО[1];
	ИначеЕсли количествоФИО = 3 Тогда
		КонтрагентОбъект.Фамилия = массивФИО[0];
		КонтрагентОбъект.Имя = массивФИО[1];
		КонтрагентОбъект.Отчество = массивФИО[2];
	Иначе
		КонтрагентОбъект.Фамилия = ДанныеСообщения.Клиент;
		КонтрагентОбъект.Имя = ДанныеСообщения.Клиент;			
	КонецЕсли;
	КонтрагентОбъект.ДатаРождения = НачалоДня(ТекущаяДата());
	КонтрагентОбъект.Комментарий = "Создан при бесконтактной передаче ТС из Мир Хендэ";
	
	КонтрагентОбъект.ОбменДанными.Загрузка = Истина;
	Попытка
		КонтрагентОбъект.Записать();
	Исключение
	КонецПопытки;
	
	Возврат КонтрагентОбъект.Ссылка;
КонецФункции

Функция СоздатьАвтомобиль(ДанныеСообщения)
	АвтомобильОбъект = Справочники.Автомобили.СоздатьЭлемент();
	АвтомобильОбъект.УстановитьНовыйКод();
	АвтомобильОбъект.VIN = ДанныеСообщения.VIN;
	АвтомобильОбъект.Модель = Справочники.Модели.НайтиПоНаименованию(ДанныеСообщения.Модель);
	АвтомобильОбъект.ФормированиеНаименованияАвтомобиля(ДанныеСообщения.ГосНомер);
	АвтомобильОбъект.Комментарий = "Создан при бесконтактной передаче ТС из Мир Хендэ";
	
	АвтомобильОбъект.ОбменДанными.Загрузка = Истина;
	Попытка
		АвтомобильОбъект.Записать();
	Исключение
	КонецПопытки;
	
	Возврат АвтомобильОбъект.Ссылка;
КонецФункции

Функция ТелефонЦифрами(Телефон)
	СтрокаТелефон = "";
	
	СимволовВПредставлении = СтрДлина(Телефон);
	Если СимволовВПредставлении > 0 Тогда
		Для сч = 1 По СимволовВПредставлении Цикл
			СимволИзНомера = Сред(Телефон, сч, 1);
			Если СтрНайти("1234567890", СимволИзНомера) > 0 Тогда
				СтрокаТелефон = СтрокаТелефон + СимволИзНомера;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если СтрДлина(СтрокаТелефон) > 10 Тогда
		СтрокаТелефон = Прав(СтрокаТелефон, 10);
	КонецЕсли;
	
	Возврат СтрокаТелефон;
КонецФункции

Процедура СоздатьНапоминание(ЗаказНаряд, МастерПриемщик)
	Если обЗначениеНеЗаполнено(ЗаказНаряд) Тогда
		Возврат;
	КонецЕсли;
	
	ПользовательМП = Справочники.Пользователи.НайтиПоРеквизиту("Сотрудник", МастерПриемщик);
	Если ЗначениеЗаполнено(ПользовательМП) Тогда
		ДатаОповещения = ТекущаяДата() + 60;
		
		НовоеНапоминание = РегистрыСведений.Напоминания.СоздатьМенеджерЗаписи();	
		// заполним измерения
		НовоеНапоминание.Пользователь			= ПользовательМП;
		НовоеНапоминание.Автор					= ПараметрыСеанса.Пользователь;
		НовоеНапоминание.Завершено				= Ложь;
		НовоеНапоминание.РеальнаяДатаОповещения = ДатаОповещения;
		НовоеНапоминание.Объект					= ЗаказНаряд;	
		// заполним ресурсы
		НовоеНапоминание.ДатаАктуальности		= '00010101';
		НовоеНапоминание.ДатаНачала				= ДатаОповещения;
		НовоеНапоминание.ДатаОповещения			= ДатаОповещения;
		НовоеНапоминание.Описание				= "Клиент произвел закладку ключа в ячейку хранения";
		НовоеНапоминание.Редактирование			= Ложь;
		НовоеНапоминание.СрокДоНачала			= 0;
		НовоеНапоминание.Тема					= "Бесконтактная передача ТС";
		НовоеНапоминание.ТипПериода				= "00";
		НовоеНапоминание.УдалитьПоИстеченииСрока= Истина;			
		
		Попытка
			НовоеНапоминание.Записать();
		Исключение КонецПопытки;
	КонецЕсли;
КонецПроцедуры
